{
    "*":"__**HELP MANUAL FOR METATRON 1 BOT**__\nCreator: pinqiblo2#8914\n\nUsing Commands:\nAll commands take parameters when you execute them. Parameters must be separated by spaces. If you have a single parameter that contains spaces (for example, a long piece of content in `/save`), then you must surround it in double-quotes (\" \"). Note that this means that you cannot use quotes in any other way, because they'll be parsed as though they were surrounding a parameter.\nSome commands have named parameters. This means that they're written in the form `/command Name: [parameter]`. If parameters are named, then you can write them in any order, and in some cases, omit them. They're mainly used for long or complex commands so that you don't have to memorize or constantly look up the parameter order.\n\nCommands:\n**-r**: Rolls dice. More info at `/help r`\n**-rr**: Repeated rolls. More info at `/help rr`\n**/avg**: Find the mean and median of a given dice roll. More info at `/help avg`\n**/save**: Stores personal text and tags. More info at `/help save`\n**/view**: Displays stored text or tag. More info at `/help view`\n**/spell**: Creates, edits, and casts Ars Magica spells. More info at `/help spell`",
    "r":"__**HELP MANUAL FOR METATRON 1 BOT**__\nSubsection: **-r**\n\nUsage: `-r [Die expression]`\nDie expression: A basic die rolling expression starts with the number of dice and the number of sides on the die. For example, `2d6` would roll two six-sided dice and take the sum.\n\nHere is a list of other features supported by the dice expression parser:\n**Arithmetic**: Additions and subtractions can be appended to die expressions. For example `2d6+5` would roll the sum mentioned above and add five to it.\n**Keeping**: Instead of taking the sum of multiple dice, the expression can be modified to take the highest or lowest dice rolled. For example, `3d10k2` would result in the sum of the highest two dice of the three rolled. Similarly, `3d10kl2` would result in the lower two dice of the same roll.\n**Explosion**: Exploding dice are ones that will keep rolling if the result on the die is the maximum value. For example, `1d6!` would roll one six-sided die once, and if the result was a six, it would roll it again. The process continues until a six is not rolled. The final result is the sum of all rolls.\n**Brevity**: Sometimes dice results can be long. Brevity mode makes the bot only show the final result of the roll. For example, `20d6b` would show only the final sum instead of showing the rolls of all twenty six-sided dice.\n**Defaults**: Every server has a set of default that are factored in for missing attributes in the die expression. For example, if a server has its default die sides set to 100, then rolling `1d` would result in a roll of one 100-sided die. Similarly, if that same server had the default die count set to 2, then simply doing `-r` would roll two 100-sided dice. Keeping can also be set as a default. No other properties can as of now.",
    "rr":"__**HELP MANUAL FOR METATRON 1 BOT**__\nSubsection: **-rr**\n\nUsage: `-rr [Die expression] [Count]`\nDie expression: For detailed information about die expressions, see `/help r`.\nCount: A single positive integer. Determines how many times to repeat the roll.\n\nThis command is for situations when you need to roll a complex expression multiple times. For example, if you had three DnD 5e skeletons attacking one player with advantage, you could do `-rr 2d20k1+4 3`, as opposed to doing `-r 2d20k1+4` 3 separate times.",
    "avg":"__**HELP MANUAL FOR METATRON 1 BOT**__\nSubsection: **/avg**\n\nUsage: `/avg [Die expression]`\nDie expression: For detailed information about die expressions, see `/help r`.\n\nThis command rolls the give die expression 10,000 times, and returns the mean and median. It's mainly just a helpful tool for figuring out basic stats on funky rolls.",
    "save":"__**HELP MANUAL FOR METATRON 1 BOT**__\nSubsection: **/save**\n\nUsage: `/save [Name] [Content]`\nName: The key by which the saved content can be referenced.\nContent: A single word, quoted text, or link. At this point in time, files are not supported as content. Images submitted through links will work, but uploaded images will not.\n\nThis command is for saving content for your character. Note that the content save is **specific to the user that saved it and the server it was saved on**. For viewing saved content, see `/help view`.",
    "view":"__**HELP MANUAL FOR METATRON 1 BOT**__\nSubsection: **/view**\n\nUsage: `/view [Name]` or `$[Name]`\nName: The key by which the saved content can be referenced.\n\nThese commands will cause the bot to send a message containing the content saved under the given name by `/save`. As noted in `/help save`, image links will work, but uploaded images cannot be saved.",
    "spell":"__**HELP MANUAL FOR METATRON 1 BOT**__\nSubsection: **/spell**\n\nUsage: `/spell [Action] ...`\nAction: Can be one of `create`, `edit`, or `cast`.\nThe rest of the parameters depend on the action.\n\n**create**:\n\tUsage: `/spell create Name: [Name] Level: [Level] Arts: [Arts] Range: [Range] Duration: [Duration] Target: [Target] Description: [Description]`\n\tName: Name of the spell. Must be quoted if multiple words.\n\tLevel: Level of the spell.\n\tArts: Arts used in the spell. Two words, quoted, and separeted by a space.\n\tRange: One of Personal, Eye, Touch, Voice, Road, Sight, or Arcane Connection.\n\tDuration: One of Momentary, Diameter, Concentration, Sun, Ring, Moon, Fire, Year, Until, Year+1, or Bargain.\n\tTarget: One of Individual, Circle, Taste, Part, Touch, Group, Room, Smell, Structure, Hearing, Bloodline, Boundary, or Vision.\n\tDescription: What your spell does.\n\tNote than properties not supplied will be filled in with defaults, except for Name, which is necessary to save the spell.\n\tSpells are saved per user per server.\n\n**edit**:\n\tUsage: `/spell edit [Name] ...`\n\tName: The name of the spell to be edited.\n\tThe rest of the parameters are the same as the **create** section, but you may use only the ones you want to change.\n\n**cast**:\n\tUsage: `/spell cast [Name]`\n\tName: The name of the spell that you would like to cast.\n\tThis command is for printing the spell out all pretty-like."
}